awscli
diff-so-fancy
fish
fpp
fzf
git
gnu-sed
grep
gti
jq
markdown
n
neovim
nnn
noti
perl
python
ruby
the_silver_searcher
tmux
vim
yarn
z
zsh
