# vim set:ft=brewfile
tap "FelixKratz/formulae"
cask "font-hack-nerd-font" # font for sketchybar
cask "sf-symbols" # apple's own nerdfont icons
brew "lua" # required for sketchybar lua plugins
brew "borders" # macos focus border 
brew "sketchybar"

tap "sst/tap"
brew "opencode"

brew "dark-mode"
brew "ldcli"
brew "mas"
brew "node"
brew "rancher-cli"
# MacOS installed through homebrew as needs to be in /usr/local/bin for some reason
# https://github.com/facebook/watchman/issues/923#issuecomment-1506301844
brew "watchman"
cask "chatgpt"
cask "copilot-cli"
cask "claude"
cask "eqmac"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "gitbutler"
cask "hot"
cask "keepingyouawake"
cask "keycastr"
cask "kitty"
cask "nikitabobko/tap/aerospace"
cask "raycast"
cask "rectangle"
cask "visual-studio-code"
cask "xbar"

# mas seems a little flakey and can sometime not realise it's installed an app
# This means every time the bundle is installed it'll try install the app,
# usually succeed but write `null` to the lockfile
mas "Hidden Bar", id: 1452453066
mas "MenuBar Stats", id: 714196447
mas "rcmd", id: 1596283165
